hide3tu/LiltingChannelLabo/2026/09/23/m5stack-cores3-tailscale-direct-voice-server/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Console on the CoreS3's native USB port. No display / audio / USB host.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

CONFIG_TAILSCALE_ENABLE=y
CONFIG_TAILSCALE_DERP_ONLY=y
CONFIG_TAILSCALE_PREFERRED_DERP_REGION=7
CONFIG_TAILSCALE_MAX_PEERS=16
CONFIG_WIREGUARD_MAX_PEERS=16

# Required by the upstream raw lwIP WireGuard netif and DERP receive task.
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_MAX_SOCKETS=16

CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# Persistent buffers avoid a NULL receive counter in TLS renegotiation checks.
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set

# The upstream control DEBUG logs can contain a registration auth key.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
